package dt.tasks;
/*

Есть текст T и строка S. Нужно найти индекс первого вхождения строки S в текст T. Перестановка символов неважна.

То есть по сути нужно найти индекс первого вхождение одной из всех возможных перестановок строки S в тексте T.

        Пример:
T: Я шёл по улице, капал дождь, было пасмурно, но моё настроение было на высоте, ведь я решил эту алгоритмическую задачу!

S: жоддь

Ответ: 22

Пояснение: индексация текста с нуля. Найдено слово дождь, так как существует перестановка жоддь -> дождь. Слово дождь в тексте начинается с 22 индекса
*/
//TODO: Решить
public class SearchIndex {
}
